{"id":0,"title":"Welcome to an Adventure Story","info":"Simply pick a choice to determine your fate in the story. If you die or are lacking a required item to continue, you MUST restart the game (refresh the page). Good luck and Merry Christmas.","outcomes":[{"id":0,"info":"The trees rustle from the wind as you lay on the ground. Your head aches with pain. You hear the crackling of fire beside you, its warm glow lighting the area. You are unsure of where you are, but you feel that you are not alone.","choices":[{"id":0,"info":"Stoke the fire","outcomePointer":2,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"Go back to sleep","outcomePointer":1,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":1,"info":"You wake up. Its still nighttime. Your head hurts a little less, but your body shivers from the cold. The fire lays dormant with only a few glowing embers remaining.","choices":[{"id":0,"info":"Stoke the fire","outcomePointer":2,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"Go back to sleep","outcomePointer":18,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":2,"info":"You get up and attend to the fire. The wind howls as you move the embers around. As the fire grows, your surroundings become more visible. Across the flames sits an old man with a pipe.","choices":[{"id":0,"info":"Ask \"Who are you?\"","outcomePointer":5,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"Grab a stick as a weapon","outcomePointer":3,"requiredItem":"NO_ITEM","givenItem":"BIG STICK"},{"id":2,"info":"Run away","outcomePointer":16,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":3,"info":"You frantically grab a big stick that lies beside you and raise it ready to swing. The old man tells you that is unnecessary with a little bit of a laugh.","choices":[{"id":0,"info":"Ask \"Who are you?\"","outcomePointer":5,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"Run Away","outcomePointer":16,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":2,"info":"Kill the old man","outcomePointer":4,"requiredItem":"BIG STICK","givenItem":"NO_ITEM"}]},{"id":4,"info":"You jump over the fire swinging the big stick like a madman. The old man yells out in pain as the stick hits his temple. The man slumps to the ground with his last breath saying: \"why?\"","choices":[{"id":0,"info":"Examine the victim","outcomePointer":15,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"Run Away","outcomePointer":16,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":5,"info":"\"I have been given many names throughout the years, but you may call me Barteld if you wish. What is your name?\" said the old man.","choices":[{"id":0,"info":"Say \"My name is Olivia\"","outcomePointer":7,"requiredItem":"NO_ITEM","givenItem":"COMBO_BOX"},{"id":1,"info":"Say \"My name is Jared\"","outcomePointer":8,"requiredItem":"NO_ITEM","givenItem":"COMBO_BOX"},{"id":2,"info":"Say \"My name is Jason\"","outcomePointer":9,"requiredItem":"NO_ITEM","givenItem":"COMBO_BOX"},{"id":3,"info":"Say \"My name is Angela\"","outcomePointer":10,"requiredItem":"NO_ITEM","givenItem":"COMBO_BOX"},{"id":4,"info":"Say \"My name is Emma\"","outcomePointer":11,"requiredItem":"NO_ITEM","givenItem":"COMBO_BOX"},{"id":5,"info":"Ask \"Where am I?\"","outcomePointer":6,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":6,"info":"Run Away","outcomePointer":16,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":7,"info":"Kill the old man","outcomePointer":4,"requiredItem":"BIG STICK","givenItem":"NO_ITEM"}]},{"id":6,"info":"\"You\u0027re just north of a small town called Marberín. I live out here by myself in a cabin east of us. Marberín is just a little to fast for me these days.\" said the old man.","choices":[{"id":0,"info":"Ask \"Will you take me in to town?\"","outcomePointer":17,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":7,"info":"\"Oh, so your name is Olivia? What a childish name. Anyways, I found this box near you with your name on it. It looks like it has a combination lock on it. Also I think you hit your head pretty good, or maybe you always looked like that. Do you think you can remember the combination?\" said the old man.","choices":[{"id":0,"info":"Say \"I can\u0027t remember\"","outcomePointer":12,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":8,"info":"\"Oh, so your name is Jared? What a nice name. Anyways, I found this box near you with your name on it. It looks like it has a combination lock on it. Also I think you hit your head pretty good, or maybe you drank too much milk. Do you think you can remember the combination?\" said the old man. ","choices":[{"id":0,"info":"Say \"I can\u0027t remember\"","outcomePointer":12,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":9,"info":"\"Oh, so your name is Jason? What a fatherly name. Anyways, I found this box near you with your name on it. It looks like it has a combination lock on it. Also I think you hit your head pretty good, or maybe you just look like that normally. Do you think you can remember the combination?\" said the old man. ","choices":[{"id":0,"info":"Say \"I can\u0027t remember\"","outcomePointer":12,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":10,"info":"\"Oh, so your name is Angela? What a pretty name. Anyways, I found this box near you with your name on it. It looks like it has a combination lock on it. Also I think you hit your head pretty good. Do you think you can remember the combination?\" said the old man. ","choices":[{"id":0,"info":"Say \"I can\u0027t remember\"","outcomePointer":12,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":11,"info":"\"Oh, so your name is Emma? What a pretty name. Anyways, I found this box near you with your name on it. It looks like it has a combination lock on it. Also I think you hit your head pretty good, how many drinks did you have last night? Do you think you can remember the combination?\" said the old man. ","choices":[{"id":0,"info":"Say \"I can\u0027t remember\"","outcomePointer":12,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":12,"info":"\"Well, thats too bad... Is there anything I could help you with?\" said the old man.","choices":[{"id":0,"info":"Ask \"Will you take me to the nearest town?\"","outcomePointer":17,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"Run Away","outcomePointer":16,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":2,"info":"Kill the old man","outcomePointer":4,"requiredItem":"BIG STICK","givenItem":"NO_ITEM"}]},{"id":13,"info":"You grab the pipe from the old man\u0027s body, scoff at him, and call him a stupid old fool. You take a few sips from the pipe and then laugh hysterically into the night sky.","choices":[{"id":0,"info":"Put pipe away","outcomePointer":15,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":14,"info":"You rip apart the poor old man with brute strength. As you carry out the deed, you lose what little sanity you had left. You swing the head around while dancing in circles and howling at the moon. ","choices":[{"id":0,"info":"Get a grip","outcomePointer":15,"requiredItem":"NO_ITEM","givenItem":"LOSS OF SANITY"}]},{"id":15,"info":"You look over the dead mans body.","choices":[{"id":0,"info":"Smoke the old mans pipe","outcomePointer":13,"requiredItem":"NO_ITEM","givenItem":"OLD MANS PIPE"},{"id":1,"info":"Dismember the old man","outcomePointer":14,"requiredItem":"NO_ITEM","givenItem":"OLD MANS HEAD"},{"id":2,"info":"Run away","outcomePointer":16,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":16,"info":"You run away as fast as you can, unsure of your surroundings. The trees fly past you as you gain distance from the fire. You run for miles unsure of where to go. You come to a stop in front of a raging river.","choices":[{"id":0,"info":"Attempt to cross the river","outcomePointer":44,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"See where the river goes","outcomePointer":43,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":17,"info":"You walk south with the old man. He rambles on about his distaste for what the town of Marberín has become. As you see the outline of the town approach, the old man stops. \"This is as far as I go.\" says the old man.","choices":[{"id":0,"info":"Say \"Thank you for your help Barteld.\"","outcomePointer":20,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"Say \"Thanks for the rambling you old coot...\"","outcomePointer":19,"requiredItem":"NO_ITEM","givenItem":"RUDENESS"},{"id":2,"info":"Say nothing and head to the town","outcomePointer":19,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":18,"info":"You have frozen to death...","choices":[]},{"id":19,"info":"You enter the town of Marberín. The town is a quiet place, where the streets are lined with friendly neighbors and the pace of life is slow and steady. As you stroll down Main Street, you notice that something seems different. The air is electric, and you can sense that something big is about to happen. Suddenly, you hear a commotion up ahead. You quicken your pace and soon find yourself at the town square, where a crowd has gathered. In the center of the square, a group of townspeople are huddled around a makeshift stage. As you draw closer, you see that a group of traveling performers have set up shop in the town. They\u0027re a ragtag group of acrobats, jugglers, and magicians, and they\u0027re putting on a show for the entire town.","choices":[{"id":0,"info":"Join the crowd and watch the show","outcomePointer":21,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"Keep walking and leave the town square","outcomePointer":22,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":2,"info":"Approach the performers and offer to help with their act","outcomePointer":23,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":20,"info":"\"Here, this lantern might help you in the future\" says Barteld.","choices":[{"id":0,"info":"Say \"thank you\" and head to town","outcomePointer":19,"requiredItem":"NO_ITEM","givenItem":"LANTERN"}]},{"id":21,"info":"You watch the show with the rest of the town, and you\u0027re amazed by the performers\u0027 skill and talent. As the show comes to an end, the crowd gives them a standing ovation. One of the performers walks around asking for a volunteer for their final act.","choices":[{"id":0,"info":"Volunteer for the final act","outcomePointer":34,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"Keep walking and leave the town square","outcomePointer":22,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":22,"info":"You decide to continue on your walk, leaving the town square behind. You wander through the quiet streets, taking in the sights and sounds of the small town. As the sun begins to set, you head back into the woods unsure of where to go. As you walk down the road, you cross a bridge that goes over some rapids.","choices":[{"id":0,"info":"Keep walking","outcomePointer":45,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":23,"info":"You approach the performers and offer to help with their act.","choices":[{"id":0,"info":"Tell the performers you know how to juggle","outcomePointer":24,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"Tell the performers you know how to swallow swords","outcomePointer":25,"requiredItem":"NO_ITEM","givenItem":"SWORD"},{"id":2,"info":"Tell the performers you are a magician","outcomePointer":26,"requiredItem":"NO_ITEM","givenItem":"WAND"},{"id":3,"info":"Tell the performers you know how to throw knives","outcomePointer":27,"requiredItem":"NO_ITEM","givenItem":"KNIFE"}]},{"id":24,"info":"The performers trust your word and let you juggle. You are surprised that you are actually good at juggling. As the show concludes, the crowd cheers and you receive flowers from the crowd.","choices":[{"id":0,"info":"Throw the showman off the soapbox and give a political rant","outcomePointer":52,"requiredItem":"HACKER_SKILLS","givenItem":"NO_ITEM"},{"id":1,"info":"Say thank you to the performers and continue on your way out of town","outcomePointer":22,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":2,"info":"Join the traveling performers\u0027 caravan","outcomePointer":50,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":25,"info":"The performers trust your word and give you a sword to swallow. ","choices":[{"id":0,"info":"Attempt to swallow sword","outcomePointer":28,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"Run from the crowd","outcomePointer":30,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":26,"info":"You tell them that you can make people disappear. The performers laugh but say they will let you attempt your act and give you a magic wand.","choices":[{"id":0,"info":"Attempt the act with a volunteer","outcomePointer":54,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"Run from the crowd","outcomePointer":30,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":27,"info":"The performers trust your word and give you a knife. They stand you in front of a turnstile with a spinning person.","choices":[{"id":0,"info":"Attempt thowing the knife at the spinning person.","outcomePointer":51,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"Run from the crowd","outcomePointer":30,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":28,"info":"You attempt to swallow the sword. Your esophagus is ripped open as the sword goes down your throat. The crowd screams as you fall the the ground, blood gushing out of your throat. You have died...","choices":[]},{"id":29,"info":"You take over the performance while the crowd is focused on you. You start going on a rant about how Marberín has been corrupted by its mayor and something has to be done about it. The crowd agrees and starts rioting. You lead the crowd to the town hall and head to the mayor\u0027s office.","choices":[{"id":0,"info":"Attempt a coup","outcomePointer":35,"requiredItem":"SUPREME_DICTATOR_PRIVILEGES","givenItem":"NO_ITEM"},{"id":1,"info":"Chicken out","outcomePointer":31,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":30,"info":"You run from the crowd as the performers chase after you yelling to give their equipment back. You run down a small ally to hide from them.","choices":[{"id":0,"info":"Hide in a trash barrel","outcomePointer":33,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"Hide in the shadows and say \"You can\u0027t find me!\"","outcomePointer":31,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":31,"info":"The police catch you and hit you on the head with a club. You black out.","choices":[{"id":0,"info":"Wake up","outcomePointer":32,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":32,"info":"You wake up in a cold, dark cell lit by a single lantern with no idea how you got there. You try to remember what led you to this point, but your mind is foggy and your memories are hazy. All you know is that you\u0027re locked up and you need to find a way out.","choices":[{"id":0,"info":"Use a knife to pick the lock","outcomePointer":45,"requiredItem":"KNIFE","givenItem":"NO_ITEM"},{"id":1,"info":"Threaten the police to let you out by swinging around a dead man\u0027s head","outcomePointer":47,"requiredItem":"OLD MANS HEAD","givenItem":"NO_ITEM"},{"id":2,"info":"Be so rude that they have no choice but to let you out","outcomePointer":46,"requiredItem":"RUDENESS","givenItem":"NO_ITEM"},{"id":3,"info":"Take Lantern","outcomePointer":32,"requiredItem":"NO_ITEM","givenItem":"LANTERN"},{"id":4,"info":"Open terminal","outcomePointer":49,"requiredItem":"NO_ITEM","givenItem":"HACKER_SKILLS"}]},{"id":33,"info":"You hid in the trash barrel and nobody found you.","choices":[{"id":0,"info":"Exit the town","outcomePointer":22,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":34,"info":"You approach the performers\u0027 magician as the crowd cheers with excitement. The magician announces that he will now make you disappear. With a wave of his magic wand, a large cloud of smoke appeared along with a loud bang.","choices":[{"id":0,"info":"Where am I?","outcomePointer":53,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":35,"info":"You are the leader of a group of rebels who have just successfully overthrown the corrupt government of your city. You and your followers storm the city hall, overpower the guards, and seize control of the government.\n\nAs the dust settles, you realize that you are now the supreme mayor of the city. You and your followers are hailed as heroes by the people, who are grateful for being freed from the tyranny of the previous government.\n\nAs the supreme mayor, you have the power to shape the future of the city. What do you do first?","choices":[{"id":0,"info":"Hold a celebration in the city square to honor your victory and the new era of freedom that has arrived.","outcomePointer":36,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"Ignore the problems facing the city and focus on maintaining your own power and wealth","outcomePointer":37,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":2,"info":"Crack down on any remaining opposition to your rule, using force if necessary to maintain your power.","outcomePointer":38,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":36,"info":"You decide to hold a celebration in the city square to honor your victory and the new era of freedom that has arrived. The people are overjoyed and grateful for your leadership, and the celebration is a resounding success.\n\nHowever, as the days go by, you begin to realize that running a city is much more difficult than you thought. You struggle to address the many challenges facing the city, including poverty, crime, and political unrest. Despite your best efforts, the problems persist and you begin to lose support from the people.","choices":[{"id":0,"info":"Do something else","outcomePointer":39,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":37,"info":"You decide to ignore the problems facing the city and focus on maintaining your own power and wealth. You use your position as supreme mayor to enrich yourself and your followers, and you pay little attention to the needs of the people.\n\nAs a result, the problems facing the city only get worse. Crime rates rise, poverty becomes more widespread, and the people grow increasingly unhappy with your rule. Eventually, a rebellion rises up to overthrow you, and you are forced to flee the city in disgrace.\n\nYour reign as supreme mayor has come to an end, and you are forced to flee the city to avoid retribution from the people you once ruled. You are left to ponder the lessons of your time as mayor and the mistakes you made along the way.","choices":[{"id":0,"info":"Exit the city","outcomePointer":22,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":38,"info":"You decide to crack down on any remaining opposition to your rule, using force if necessary to maintain your power. You establish a secret police force to root out any dissent and silence any critics.\n\nInitially, this strategy seems to work. The opposition is crushed and the people are cowed into submission. However, as time goes on, the people begin to resent your rule. They see you as a tyrant, and they begin to plot against you. Eventually, a group of rebels rises up to overthrow you, and you are forced to flee the city in disgrace.\n\nYour rule has been marked by fear and repression, and the people are glad to see you go. You are forced to flee the city and go into hiding to avoid retribution for your actions. You are left to ponder the lessons of your time as supreme mayor and the mistakes you made along the way.","choices":[{"id":0,"info":"Exit the city","outcomePointer":22,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":39,"info":"You are the leader of a group of rebels who have just successfully overthrown the corrupt government of your city. You and your followers storm the city hall, overpower the guards, and seize control of the government.\n\nAs the dust settles, you realize that you are now the supreme mayor of the city. You and your followers are hailed as heroes by the people, who are grateful for being freed from the tyranny of the previous government.\n\nAs the supreme mayor, you have the power to shape the future of the city. What do you do first?","choices":[{"id":0,"info":"Ignore the problems facing the city and focus on maintaining your own power and wealth","outcomePointer":37,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"Crack down on any remaining opposition to your rule, using force if necessary to maintain your power.","outcomePointer":38,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":2,"info":"Commission the town\u0027s greatest locksmith to crack open your COMBO_BOX","outcomePointer":40,"requiredItem":"COMBO_BOX","givenItem":"NO_ITEM"}]},{"id":40,"info":"The town\u0027s greatest locksmith appears and kneels before you as he beholds your greatness. He examines the box and says: \"What are you stupid?? The combination is 246 and proceeds to open the box.\"","choices":[{"id":0,"info":"Have the locksmith beheaded for his insolence","outcomePointer":41,"requiredItem":"NO_ITEM","givenItem":"LOCKSMITHS_HEAD"},{"id":1,"info":"Host a celebration in the town square commemorating the great day that you, the supreme mayor, opened your combination box.","outcomePointer":42,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":41,"info":"You have the town\u0027s people gather at the town square for the grand opening of the town\u0027s new guillotine.","choices":[{"id":0,"info":"Order for the lever to be pulled","outcomePointer":42,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"Forgive the locksmith, granting him his life, but banish him from the town.","outcomePointer":42,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":42,"info":"This story is getting too absurd and you already have your combination. Why are you still here????","choices":[]},{"id":43,"info":"As you walk along the side of the river, you notice that you have come to a fork in the road. There is a bridge that allows you to cross the river and a road in the opposite direction with a sign that says Marberín.","choices":[{"id":0,"info":"Cross the bridge","outcomePointer":45,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"Go to Marberín","outcomePointer":19,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":44,"info":"The river current is strong, but you are sure that you can cross it. You attempt the crossing, but the water gets deeper and deeper. You are swept away by the current. You attempt to swim back, but the current is too strong. The river soon turns into rapids, and you are thrown repeatedly against the rocks. You have died...","choices":[]},{"id":45,"info":"You just crossed a bridge and approach what appears to be a cave. Although the cave appears natural, there seem to be occasional geometric lines and symmetry that you are sure only a human could have made.","choices":[{"id":0,"info":"Enter the DARK cave","outcomePointer":45,"requiredItem":"LANTERN","givenItem":"NO_ITEM"}]},{"id":46,"info":"The guards were so annoyed with how rude you were, that they let you out and told you to never come back to this town.","choices":[{"id":0,"info":"Well that was easy...","outcomePointer":22,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":47,"info":"The guards were terrified by the fact that an old man\u0027s head appeared from nowhere and you were now spinning it around in the air saying you\u0027d do the same thing to them if they didn\u0027t let you out. The guards let you out and told you to never come back to this town.","choices":[{"id":0,"info":"Well that was easy...","outcomePointer":22,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":48,"info":"You opened the cell with ease using your newly acquired knife that the guards somehow didn\u0027t confiscate. You walk out of the prison cell acting like it was a normal day and continued out of town.","choices":[{"id":0,"info":"Well that was easy...","outcomePointer":22,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":49,"info":"You open a terminal with your newly acquired hacker skillz. You realize that the game developer got tired of writing storylines since it was 2:28 am and the gift (this story) was due that morning. You decide to add the option to restart the game with all of your acquired items and accept the fact that this might break the game.","choices":[{"id":0,"info":"Restart the game with all your acquired items","outcomePointer":0,"requiredItem":"HACKER_SKILLS","givenItem":"NO_ITEM"}]},{"id":50,"info":"You join the traveling performers\u0027 caravan because you apparently care nothing about figuring out what the combination to your box is and would instead like me to continue writing side stories for no reason. Your punishment is restarting the game.","choices":[{"id":0,"info":"Don\u0027t listen to the narrator and attempt to hack the game","outcomePointer":51,"requiredItem":"HACKER_SKILLS","givenItem":"NO_ITEM"}]},{"id":51,"info":"You try throwing one of the knives and end up impaling the performer. The crowd screams as the performer spins around with blood spurting from his wound.","choices":[{"id":0,"info":"Run from the croud","outcomePointer":30,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"Turn your self in","outcomePointer":31,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":52,"info":"You enter the dark cave using your lantern to help you see. The path seems to get tighter and more man-made as you move along. ","choices":[{"id":0,"info":"Examine your surroundings","outcomePointer":53,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":53,"info":"You realize you are in a labyrinth. Its very dark and without a lantern you couldn\u0027t see at all.","choices":[{"id":0,"info":"Go forward","outcomePointer":55,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"Go left","outcomePointer":56,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":2,"info":"Go right","outcomePointer":57,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":54,"info":"The crowd screams with terror as the spell slowly turns the volunteer inside out causing him to implode. You say \"I made him disappear!\" with a large grin.","choices":[{"id":0,"info":"Run from the crowd","outcomePointer":30,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"Turn yourself in","outcomePointer":31,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":55,"info":"You walk forward 10 meters and hit a dead end","choices":[{"id":0,"info":"Go back","outcomePointer":53,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":56,"info":"You turn left and walk 40 meters.","choices":[{"id":0,"info":"Go right","outcomePointer":58,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"Go back","outcomePointer":53,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":57,"info":"You turn right and walk 20 meters","choices":[{"id":0,"info":"Go left","outcomePointer":59,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"Go back","outcomePointer":53,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":58,"info":"You turn right and walk 60 meters","choices":[{"id":0,"info":"Turn right","outcomePointer":60,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"Go back","outcomePointer":56,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":59,"info":"You turn left and walk 30 meters","choices":[{"id":0,"info":"Go left","outcomePointer":61,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"Go back","outcomePointer":57,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":60,"info":"You turn right and walk 20 meters","choices":[{"id":0,"info":"Go right","outcomePointer":65,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"Go left","outcomePointer":66,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":2,"info":"Go back","outcomePointer":58,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":61,"info":"You turn left and go 20 meters","choices":[{"id":0,"info":"Go forward","outcomePointer":62,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"Go right","outcomePointer":64,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":2,"info":"Go back","outcomePointer":59,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":62,"info":"You walk forward 20 meters","choices":[{"id":0,"info":"Go left","outcomePointer":63,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"Go back","outcomePointer":61,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":63,"info":"You turn left and walk forward 10 meters. You have hit a dead end","choices":[{"id":0,"info":"Go back","outcomePointer":62,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":64,"info":"You turn right and walk 20 meters","choices":[{"id":0,"info":"Go forward","outcomePointer":67,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"Go right","outcomePointer":68,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":2,"info":"Go back","outcomePointer":61,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":65,"info":"You turn right and walk 10 meters. You have hit a dead end.","choices":[{"id":0,"info":"Go back","outcomePointer":60,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":66,"info":"You turn left and walk 20 meters. You have found the exit.","choices":[{"id":0,"info":"Enter the inner sanctum","outcomePointer":70,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":67,"info":"You walk forward 10 meters and hit a dead end","choices":[{"id":0,"info":"Go back","outcomePointer":64,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":68,"info":"You turn right and walk 20 meters","choices":[{"id":0,"info":"Turn left","outcomePointer":69,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"},{"id":1,"info":"Go back","outcomePointer":64,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":69,"info":"You turn left and walk 10 meters. You have hit a dead end.","choices":[{"id":0,"info":"Go back","outcomePointer":68,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":70,"info":"You have finally emerged from the Labyrinth after weeks of navigating its winding corridors and treacherous traps. As you emerge into the inner sanctum, you are greeted by the sight of Barteld, a powerful dark mage with a long beard and piercing eyes.\n\nYou have heard many stories about Barteld and his legendary magical powers that transcend death itself. You are not sure that you can best him.","choices":[{"id":0,"info":"Confront Barteld and try to defeat him with your sword","outcomePointer":72,"requiredItem":"SWORD","givenItem":"NO_ITEM"},{"id":1,"info":"Confront Barteld and try using your magic wand to make him disappear","outcomePointer":72,"requiredItem":"WAND","givenItem":"NO_ITEM"},{"id":2,"info":"Confront Barteld and try to defeat him with your knife","outcomePointer":72,"requiredItem":"KNIFE","givenItem":"NO_ITEM"},{"id":3,"info":"Confront Barteld and try to defeat him with your big stick","outcomePointer":72,"requiredItem":"BIG STICK","givenItem":"NO_ITEM"},{"id":4,"info":"Open terminal","outcomePointer":73,"requiredItem":"HACKER_SKILLS","givenItem":"NO_ITEM"},{"id":5,"info":"Try to reason with him and plead for mercy","outcomePointer":71,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":71,"info":"\"You think I would give you mercy? Many have tried to kill me including yourself in different timelines. Never did anyone show me mercy\" Barteld said while laughing hysterically. Barteld pulls out his staff and screams \"This is for cutting off my head!\" and slams his staff on the ground. Your body is crushed by the weight of a thousand suns. You have died...","choices":[]},{"id":72,"info":"\"No object made by mere mortals could truly kill me, you should know that by now!\" Barteld said while laughing hysterically. Barteld pulls out his staff and screams \"This is for cutting off my head!\" and slams his staff on the ground. Your body is crushed by the weight of a thousand suns. You have died...","choices":[]},{"id":73,"info":"You open a terminal. Barteld is caught off guard by the computer screen that appeared out of nowhere. \"What kind of sorcery is this?!\" asked Barteld.","choices":[{"id":0,"info":"Request cheat code","outcomePointer":73,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":74,"info":"Request Received...Processing...What would you like to do?","choices":[{"id":0,"info":"Delete Barteld","outcomePointer":74,"requiredItem":"NO_ITEM","givenItem":"NO_ITEM"}]},{"id":75,"info":"\"Wait, I don\u0027t understa-\" screamed Barteld as you removed his very existence. \"Entity deleted...Anything Else?\"","choices":[{"id":0,"info":"Take me to the best timeline","outcomePointer":30,"requiredItem":"NO_ITEM","givenItem":"SUPREME_DICTATOR_PRIVILEGES"}]}],"requiredItems":["NO_ITEM","BIG STICK","OLD MANS PIPE","OLIVIAS_BOX","JAREDS BOX","OLIVIAS BOX","JASONS BOX","ANGELAS BOX","EMMAS BOX","OLD MANS HEAD","LOSS OF SANITY","Rudeness","RUDENESS","LANTERN","SWORD","KNIFE","WAND","COMBO_BOX","LOCKSMITHS_HEAD","HACKER_SKILLS","SUPREME_DICTATOR_PRIVILEGES"]}